pchwalek/buzzcam/STM32_WPAN/App/app_ble.c
static BleApplicationContext_t BleApplicationContext;
static uint16_t AdvIntervalMin, AdvIntervalMax;

static const char a_LocalName[] = {AD_TYPE_COMPLETE_LOCAL_NAME ,'B','U','Z','Z','C'};
uint8_t a_ManufData[14] = {sizeof(a_ManufData)-1,
                           AD_TYPE_MANUFACTURER_SPECIFIC_DATA,
                           0x01 /*SKD version */,
                           0x00 /* Generic*/,
                           0x00 /* GROUP A Feature  */,
                           0x00 /* GROUP A Feature */,
                           0x00 /* GROUP B Feature */,
                           0x00 /* GROUP B Feature */,
                           0x00, /* BLE MAC start -MSB */
                           0x00,
                           0x00,
                           0x00,
                           0x00,
                           0x00, /* BLE MAC stop */
                          };

/* USER CODE BEGIN PV */
/* USER CODE BEGIN PV */
#else
PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_CmdPacket_t BleCmdBuffer;

static const uint8_t a_MBdAddr[BD_ADDR_SIZE_LOCAL] = {
		(uint8_t) ((CFG_ADV_BD_ADDRESS & 0x0000000000FF)),
		(uint8_t) ((CFG_ADV_BD_ADDRESS & 0x00000000FF00) >> 8),
		(uint8_t) ((CFG_ADV_BD_ADDRESS & 0x000000FF0000) >> 16),
		(uint8_t) ((CFG_ADV_BD_ADDRESS & 0x0000FF000000) >> 24),
		(uint8_t) ((CFG_ADV_BD_ADDRESS & 0x00FF00000000) >> 32),
		(uint8_t) ((CFG_ADV_BD_ADDRESS & 0xFF0000000000) >> 40) };

static uint8_t a_BdAddrUdn[BD_ADDR_SIZE_LOCAL];
/**
 *   Identity root key used to derive LTK and CSRK
 */
static const uint8_t a_BLE_CfgIrValue[16] = CFG_BLE_IRK;

/**
 * Encryption root key used to derive LTK and CSRK
 */
static const uint8_t a_BLE_CfgErValue[16] = CFG_BLE_ERK;


				/**
				 * These are the two tags used to manage a power failure during OTA
				 * The MagicKeywordAdress shall be mapped @0x140 from start of the binary image
				 * The MagicKeywordvalue is checked in the ble_ota application
				 */
//				PLACE_IN_SECTION("TAG_OTA_END") const uint32_t MagicKeywordValue = 0x94448A29;
//				PLACE_IN_SECTION("TAG_OTA_START") const uint32_t MagicKeywordAddress = (uint32_t)&MagicKeywordValue;
//
//				PLACE_IN_SECTION("BLE_APP_CONTEXT") static BleApplicationContext_t BleApplicationContext;
//				PLACE_IN_SECTION("BLE_APP_CONTEXT") static uint16_t AdvIntervalMin,
//AdvIntervalMax;
//				static BleApplicationContext_t BleApplicationContext;
//				static uint16_t AdvIntervalMin, AdvIntervalMax;

static BleApplicationContext_t BleApplicationContext;
static uint16_t AdvIntervalMin, AdvIntervalMax;

uint8_t a_ManufData[14] = { sizeof(a_ManufData) - 1,
AD_TYPE_MANUFACTURER_SPECIFIC_DATA, 0x01/*SKD version */, 0x83 /* Generic*/,
		0x00 /* GROUP A Feature  */, 0x00 /* GROUP A Feature */,
		CFG_FEATURE_THREAD_SWITCH /* GROUP B Feature */, 0x00 /* GROUP B Feature */, 0x00, /* BLE MAC start -MSB */
		0x00, 0x00, 0x00, 0x00, 0x00, /* BLE MAC stop */

};

//uint8_t manuf_data[15] = { 0x02, 0x01, 0x06, 0x0B, 0x16, 0xF6, 0xFF, 0x00, 0x00, 0x0F, 0xF1, 0xFF, 0x04, 0x80, 0x00, };

uint8_t a_ManufDataCameraWakeup[28];

#endif

osThreadId_t LinkConfigProcessId;
osThreadId_t AdvCancelProcessId;
osThreadId_t AdvReqProcessId;
/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
osSemaphoreId_t SemHciId;
osThreadId_t AdvUpdateProcessId;
osThreadId_t HciUserEvtProcessId;

const osThreadAttr_t AdvUpdateProcess_attr = {
    .name = CFG_ADV_UPDATE_PROCESS_NAME,
    .attr_bits = CFG_ADV_UPDATE_PROCESS_ATTR_BITS,
    .cb_mem = CFG_ADV_UPDATE_PROCESS_CB_MEM,
    .cb_size = CFG_ADV_UPDATE_PROCESS_CB_SIZE,
    .stack_mem = CFG_ADV_UPDATE_PROCESS_STACK_MEM,
    .priority = CFG_ADV_UPDATE_PROCESS_PRIORITY,
    .stack_size = CFG_ADV_UPDATE_PROCESS_STACK_SIZE
};

const osThreadAttr_t HciUserEvtProcess_attr = {
    .name = CFG_HCI_USER_EVT_PROCESS_NAME,
    .attr_bits = CFG_HCI_USER_EVT_PROCESS_ATTR_BITS,
    .cb_mem = CFG_HCI_USER_EVT_PROCESS_CB_MEM,
    .cb_size = CFG_HCI_USER_EVT_PROCESS_CB_SIZE,
    .stack_mem = CFG_HCI_USER_EVT_PROCESS_STACK_MEM,
    .priority = CFG_HCI_USER_EVT_PROCESS_PRIORITY,
    .stack_size = CFG_HCI_USER_EVT_PROCESS_STACK_SIZE
};

/* Private function prototypes -----------------------------------------------*/
static void HciUserEvtProcess(void *argument);
static void BLE_UserEvtRx(void *p_Payload);
static void BLE_StatusNot(HCI_TL_CmdStatus_t Status);
static void Ble_Tl_Init(void);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGetBdAddress(void);
void Adv_Request(APP_BLE_ConnStatus_t NewStatus);
static void Add_Advertisment_Service_UUID(uint16_t servUUID);
static void Adv_Mgr(void);
static void AdvUpdateProcess(void *argument);
static void Adv_Update(void);

/* USER CODE BEGIN PFP */
char a_LocalName[21] = {0};
char a_buzzCamName[20] = {0};
char a_camName[20] = {0};
/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
//void APP_BLE_Init(void)
//{
//  SHCI_CmdStatus_t status;
//  /* USER CODE BEGIN APP_BLE_Init_1 */
//#ifndef CUSTOM_BT_PARAMETERS
//  /* USER CODE END APP_BLE_Init_1 */
//  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
//  {
//    {{0,0,0}},                          /**< Header unused */
//    {0,                                 /** pBleBufferAddress not used */
//     0,                                 /** BleBufferSize not used */
//     CFG_BLE_NUM_GATT_ATTRIBUTES,
//     CFG_BLE_NUM_GATT_SERVICES,
//     CFG_BLE_ATT_VALUE_ARRAY_SIZE,
//     CFG_BLE_NUM_LINK,
//     CFG_BLE_DATA_LENGTH_EXTENSION,
//     CFG_BLE_PREPARE_WRITE_LIST_SIZE,
//     CFG_BLE_MBLOCK_COUNT,
//     CFG_BLE_MAX_ATT_MTU,
//     CFG_BLE_PERIPHERAL_SCA,
//     CFG_BLE_CENTRAL_SCA,
//     CFG_BLE_LS_SOURCE,
//     CFG_BLE_MAX_CONN_EVENT_LENGTH,
//     CFG_BLE_HSE_STARTUP_TIME,
//     CFG_BLE_VITERBI_MODE,
//     CFG_BLE_OPTIONS,
//     0,
//     CFG_BLE_MAX_COC_INITIATOR_NBR,
//     CFG_BLE_MIN_TX_POWER,
//     CFG_BLE_MAX_TX_POWER,
//     CFG_BLE_RX_MODEL_CONFIG,
//     CFG_BLE_MAX_ADV_SET_NBR,
//     CFG_BLE_MAX_ADV_DATA_LEN,
//     CFG_BLE_TX_PATH_COMPENS,
//     CFG_BLE_RX_PATH_COMPENS,
//     CFG_BLE_CORE_VERSION,
//     CFG_BLE_OPTIONS_EXT
//    }
//  };
//
//  /**
//   * Initialize Ble Transport Layer
//   */
//  Ble_Tl_Init();
//
//  /**
//   * Do not allow standby in the application
//   */
//  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);
//
//  /**
//   * Register the hci transport layer to handle BLE User Asynchronous Events
//   */
//  HciUserEvtProcessId = osThreadNew(HciUserEvtProcess, NULL, &HciUserEvtProcess_attr);
//
//  /**
//   * Starts the BLE Stack on CPU2
//   */
//  status = SHCI_C2_BLE_Init(&ble_init_cmd_packet);
//  if (status != SHCI_Success)
//  {
//    APP_DBG_MSG("  Fail   : SHCI_C2_BLE_Init command, result: 0x%02x\n\r", status);
//    /* if you are here, maybe CPU2 doesn't contain STM32WB_Copro_Wireless_Binaries, see Release_Notes.html */
//    Error_Handler();
//  }
//  else
//  {
//    APP_DBG_MSG("  Success: SHCI_C2_BLE_Init command\n\r");
//  }
//
//  /**
//   * Initialization of HCI & GATT & GAP layer
//   */
//  Ble_Hci_Gap_Gatt_Init();
//
//  /**
//   * Initialization of the BLE Services
//   */
//  SVCCTL_Init();
//
//  /**
//   * Initialization of the BLE App Context
//   */
//  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
//  BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;
//
//  /**
//   * From here, all initialization are BLE application specific
//   */
//  AdvUpdateProcessId = osThreadNew(AdvUpdateProcess, NULL, &AdvUpdateProcess_attr);
//
//  /**
//   * Initialization of ADV - Ad Manufacturer Element - Support OTA Bit Mask
//   */
//#if (BLE_CFG_OTA_REBOOT_CHAR != 0)
//  a_ManufData[sizeof(a_ManufData)-8] = CFG_FEATURE_OTA_REBOOT;
//#endif /* BLE_CFG_OTA_REBOOT_CHAR != 0 */
//
//  /**
//   * Initialize DIS Application
//   */
//  DISAPP_Init();
//
//  /**
//   * Initialize HRS Application
//   */
//  HRSAPP_Init();
//
//  /* USER CODE BEGIN APP_BLE_Init_3 */
//  /* USER CODE BEGIN APP_BLE_Init_3 */
//#else
//  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
//   {
//     {{0,0,0}},                          /**< Header unused */
//     {0,                                 /** pBleBufferAddress not used */
//      0,                                 /** BleBufferSize not used */
//      CFG_BLE_NUM_GATT_ATTRIBUTES,
//      CFG_BLE_NUM_GATT_SERVICES,
//      CFG_BLE_ATT_VALUE_ARRAY_SIZE,
//      CFG_BLE_NUM_LINK,
//      CFG_BLE_DATA_LENGTH_EXTENSION,
//      CFG_BLE_PREPARE_WRITE_LIST_SIZE,
//      CFG_BLE_MBLOCK_COUNT,
//      CFG_BLE_MAX_ATT_MTU,
//      CFG_BLE_SLAVE_SCA,
//      CFG_BLE_MASTER_SCA,
//      CFG_BLE_LS_SOURCE,
//      CFG_BLE_MAX_CONN_EVENT_LENGTH,
//      CFG_BLE_HSE_STARTUP_TIME,
//      CFG_BLE_VITERBI_MODE,
//      CFG_BLE_OPTIONS,
//      0,
//      CFG_BLE_MAX_COC_INITIATOR_NBR,
//      CFG_BLE_MIN_TX_POWER,
//      CFG_BLE_MAX_TX_POWER,
//      CFG_BLE_RX_MODEL_CONFIG,
//      CFG_BLE_MAX_ADV_SET_NBR,
//      CFG_BLE_MAX_ADV_DATA_LEN,
//      CFG_BLE_TX_PATH_COMPENS,
//      CFG_BLE_RX_PATH_COMPENS,
//      CFG_BLE_CORE_VERSION,
//      CFG_BLE_OPTIONS_EXT
//     }
//   };
//
//  a_ManufDataCameraWakeup[0] = sizeof(a_ManufDataCameraWakeup) - 1;
//  a_ManufDataCameraWakeup[1] = AD_TYPE_MANUFACTURER_SPECIFIC_DATA;
//  /* set the manufacturing data for wakeon packet */
//  a_ManufDataCameraWakeup[2] = 0x4c;
//  a_ManufDataCameraWakeup[3] = 0x00;
//  a_ManufDataCameraWakeup[4] = 0x02;
//  a_ManufDataCameraWakeup[5] = 0x15;
//  a_ManufDataCameraWakeup[6] = 0x09;
//  a_ManufDataCameraWakeup[7] = 0x4f;
//  a_ManufDataCameraWakeup[8] = 0x52;
//  a_ManufDataCameraWakeup[9] = 0x42;
//  a_ManufDataCameraWakeup[10] = 0x49;
//  a_ManufDataCameraWakeup[11] = 0x54;
//  a_ManufDataCameraWakeup[12] = 0x09;
//  a_ManufDataCameraWakeup[13] = 0xff;
//  a_ManufDataCameraWakeup[14] = 0x0f;
//  a_ManufDataCameraWakeup[15] = 0x00;
//    /* note: see powerOnPrevConnectedCameras() for bytes 16-21 */
//  a_ManufDataCameraWakeup[22] = 0x00;
//  a_ManufDataCameraWakeup[23] = 0x00;
//  a_ManufDataCameraWakeup[24] = 0x00;
//  a_ManufDataCameraWakeup[25] = 0x00;
//  a_ManufDataCameraWakeup[26] = 0xe4;
//  a_ManufDataCameraWakeup[27] = 0x01;
//
//   /**
//    * Initialize Ble Transport Layer
//    */
//   Ble_Tl_Init();
//
//   /**
//    * Do not allow standby in the application
//    */
//   UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);
//
//   /**
//    * Register the hci transport layer to handle BLE User Asynchronous Events
//    */
//   HciUserEvtProcessId = osThreadNew(HciUserEvtProcess, NULL, &HciUserEvtProcess_attr);
//
//   /**
//    * Starts the BLE Stack on CPU2
//    */
//   status = SHCI_C2_BLE_Init(&ble_init_cmd_packet);
//   if (status != SHCI_Success)
//   {
//     APP_DBG_MSG("  Fail   : SHCI_C2_BLE_Init command, result: 0x%02x\n\r", status);
//     /* if you are here, maybe CPU2 doesn't contain STM32WB_Copro_Wireless_Binaries, see Release_Notes.html */
//     Error_Handler();
//   }
//   else
//   {
//     APP_DBG_MSG("  Success: SHCI_C2_BLE_Init command\n\r");
//   }
//
//   /**
//    * Initialization of HCI & GATT & GAP layer
//    */
//   Ble_Hci_Gap_Gatt_Init();
//
//   /**
//    * Initialization of the BLE Services
//    */
//   SVCCTL_Init();
//
//   /**
//    * Initialization of the BLE App Context
//    */
//   BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
//   BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;
//
//   /**
//    * From here, all initialization are BLE application specific
//    */
//   AdvUpdateProcessId = osThreadNew(AdvUpdateProcess, NULL, &AdvUpdateProcess_attr);
//
//   /**
//    * Initialization of ADV - Ad Manufacturer Element - Support OTA Bit Mask
//    */
// #if (BLE_CFG_OTA_REBOOT_CHAR != 0)
//   a_ManufData[sizeof(a_ManufData)-8] = CFG_FEATURE_OTA_REBOOT;
// #endif /* BLE_CFG_OTA_REBOOT_CHAR != 0 */
//#endif
//
//#ifndef CUSTOM_BT_PARAMETERS
//  /* USER CODE END APP_BLE_Init_3 */
//
//  /**
//   * Create timer to handle the connection state machine
//   */
//  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.Advertising_mgr_timer_Id), hw_ts_SingleShot, Adv_Mgr);
//
//  /**
//   * Make device discoverable
//   */
//  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = AD_TYPE_16_BIT_SERV_UUID;
//  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 1;
//  Add_Advertisment_Service_UUID(HEART_RATE_SERVICE_UUID);
//
//  /* Initialize intervals for reconnexion without intervals update */
//  AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
//  AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;
//
//  /**
//   * Start to Advertise to be connected by Collector
//   */
//  Adv_Request(APP_BLE_FAST_ADV);
//
//  /* USER CODE BEGIN APP_BLE_Init_2 */
//  /* USER CODE BEGIN APP_BLE_Init_2 */
//#else
//  /**
//   * Create timer to handle the connection state machine
//   */
//  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.Advertising_mgr_timer_Id), hw_ts_SingleShot, Adv_Mgr);
//
//  /**
//   * Make device discoverable
//   */
//  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = AD_TYPE_16_BIT_SERV_UUID;
//  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 1;
//  Add_Advertisment_Service_UUID(BUZZCAM_SERVICE_UUID);
//
//  /* Initialize intervals for reconnexion without intervals update */
//  AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
//  AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;
//
//  /**
//   * Start to Advertise to be connected by Collector
//   */
//  Adv_Request(APP_BLE_FAST_ADV);
//#endif
//  /* USER CODE END APP_BLE_Init_2 */
//
//  return;
//}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *p_Pckt)
{
  hci_event_pckt    *p_event_pckt;
  evt_le_meta_event *p_meta_evt;
  evt_blecore_aci   *p_blecore_evt;
  uint8_t           Tx_phy, Rx_phy;
  tBleStatus        ret = BLE_STATUS_INVALID_PARAMS;
  hci_le_connection_complete_event_rp0        *p_connection_complete_event;
  hci_disconnection_complete_event_rp0        *p_disconnection_complete_event;
  hci_le_phy_update_complete_event_rp0        *p_evt_le_phy_update_complete;
#if (CFG_DEBUG_APP_TRACE != 0)
  hci_le_connection_update_complete_event_rp0 *p_connection_update_complete_event;
#endif /* CFG_DEBUG_APP_TRACE != 0 */

