pchwalek/buzzcam/STM32_WPAN/App/app_ble.c
        /* USER CODE BEGIN BLUE_EVT */

        /* USER CODE END BLUE_EVT */
      }
      break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

      /* USER CODE BEGIN EVENT_PCKT */

      /* USER CODE END EVENT_PCKT */

    default:
      /* USER CODE BEGIN ECODE_DEFAULT*/

      /* USER CODE END ECODE_DEFAULT*/
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
  return BleApplicationContext.Device_Connection_Status;
}

/* USER CODE BEGIN FD*/
void APP_BLE_Init_Dyn_1( void )
{
	  SHCI_CmdStatus_t status;
	#ifndef CUSTOM_BT_PARAMETERS
	  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
	  {
	    {{0,0,0}},                          /**< Header unused */
	    {0,                                 /** pBleBufferAddress not used */
	     0,                                 /** BleBufferSize not used */
	     CFG_BLE_NUM_GATT_ATTRIBUTES,
	     CFG_BLE_NUM_GATT_SERVICES,
	     CFG_BLE_ATT_VALUE_ARRAY_SIZE,
	     CFG_BLE_NUM_LINK,
	     CFG_BLE_DATA_LENGTH_EXTENSION,
	     CFG_BLE_PREPARE_WRITE_LIST_SIZE,
	     CFG_BLE_MBLOCK_COUNT,
	     CFG_BLE_MAX_ATT_MTU,
	     CFG_BLE_PERIPHERAL_SCA,
	     CFG_BLE_CENTRAL_SCA,
	     CFG_BLE_LS_SOURCE,
	     CFG_BLE_MAX_CONN_EVENT_LENGTH,
	     CFG_BLE_HSE_STARTUP_TIME,
	     CFG_BLE_VITERBI_MODE,
	     CFG_BLE_OPTIONS,
	     0,
	     CFG_BLE_MAX_COC_INITIATOR_NBR,
	     CFG_BLE_MIN_TX_POWER,
	     CFG_BLE_MAX_TX_POWER,
	     CFG_BLE_RX_MODEL_CONFIG,
	     CFG_BLE_MAX_ADV_SET_NBR,
	     CFG_BLE_MAX_ADV_DATA_LEN,
	     CFG_BLE_TX_PATH_COMPENS,
	     CFG_BLE_RX_PATH_COMPENS,
	     CFG_BLE_CORE_VERSION,
	     CFG_BLE_OPTIONS_EXT
	    }
	  };

	  /**
	   * Initialize Ble Transport Layer
	   */
	  Ble_Tl_Init();

	  /**
	   * Do not allow standby in the application
	   */
	  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

	  /**
	   * Register the hci transport layer to handle BLE User Asynchronous Events
	   */
	  HciUserEvtProcessId = osThreadNew(HciUserEvtProcess, NULL, &HciUserEvtProcess_attr);

	  /**
	   * Starts the BLE Stack on CPU2
	   */
	  status = SHCI_C2_BLE_Init(&ble_init_cmd_packet);
	  if (status != SHCI_Success)
	  {
	    APP_DBG_MSG("  Fail   : SHCI_C2_BLE_Init command, result: 0x%02x\n\r", status);
	    /* if you are here, maybe CPU2 doesn't contain STM32WB_Copro_Wireless_Binaries, see Release_Notes.html */
	    Error_Handler();
	  }
	  else
	  {
	    APP_DBG_MSG("  Success: SHCI_C2_BLE_Init command\n\r");
	  }

	  /**
	   * Initialization of HCI & GATT & GAP layer
	   */
	  Ble_Hci_Gap_Gatt_Init();

	  /**
	   * Initialization of the BLE Services
	   */
	  SVCCTL_Init();

	  /**
	   * Initialization of the BLE App Context
	   */
	  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
	  BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;

	  /**
	   * From here, all initialization are BLE application specific
	   */
	  AdvUpdateProcessId = osThreadNew(AdvUpdateProcess, NULL, &AdvUpdateProcess_attr);

	  /**
	   * Initialization of ADV - Ad Manufacturer Element - Support OTA Bit Mask
	   */
	#if (BLE_CFG_OTA_REBOOT_CHAR != 0)
	  a_ManufData[sizeof(a_ManufData)-8] = CFG_FEATURE_OTA_REBOOT;
	#endif /* BLE_CFG_OTA_REBOOT_CHAR != 0 */

	  /**
	   * Initialize DIS Application
	   */
	  DISAPP_Init();

	  /**
	   * Initialize HRS Application
	   */
	  HRSAPP_Init();


	#else
//	  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
//	   {
//	     {{0,0,0}},                          /**< Header unused */
//	     {0,                                 /** pBleBufferAddress not used */
//	      0,                                 /** BleBufferSize not used */
//	      CFG_BLE_NUM_GATT_ATTRIBUTES,
//	      CFG_BLE_NUM_GATT_SERVICES,
//	      CFG_BLE_ATT_VALUE_ARRAY_SIZE,
//	      CFG_BLE_NUM_LINK,
//	      CFG_BLE_DATA_LENGTH_EXTENSION,
//	      CFG_BLE_PREPARE_WRITE_LIST_SIZE,
//	      CFG_BLE_MBLOCK_COUNT,
//	      CFG_BLE_MAX_ATT_MTU,
//	      CFG_BLE_SLAVE_SCA,
//	      CFG_BLE_MASTER_SCA,
//	      CFG_BLE_LS_SOURCE,
//	      CFG_BLE_MAX_CONN_EVENT_LENGTH,
//	      CFG_BLE_HSE_STARTUP_TIME,
//	      CFG_BLE_VITERBI_MODE,
//	      CFG_BLE_OPTIONS,
//	      0,
//	      CFG_BLE_MAX_COC_INITIATOR_NBR,
//	      CFG_BLE_MIN_TX_POWER,
//	      CFG_BLE_MAX_TX_POWER,
//	      CFG_BLE_RX_MODEL_CONFIG,
//	      CFG_BLE_MAX_ADV_SET_NBR,
//	      CFG_BLE_MAX_ADV_DATA_LEN,
//	      CFG_BLE_TX_PATH_COMPENS,
//	      CFG_BLE_RX_PATH_COMPENS,
//	      CFG_BLE_CORE_VERSION,
//	      CFG_BLE_OPTIONS_EXT
//	     }
//	   };

//		SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet = { { { 0, 0, 0 } }, /**< Header unused */
//		{ 0, /** pBleBufferAddress not used */
//		0, /** BleBufferSize not used */
//		CFG_BLE_NUM_GATT_ATTRIBUTES,
//		CFG_BLE_NUM_GATT_SERVICES,
//		CFG_BLE_ATT_VALUE_ARRAY_SIZE,
//		CFG_BLE_NUM_LINK,
//		CFG_BLE_DATA_LENGTH_EXTENSION,
//		CFG_BLE_PREPARE_WRITE_LIST_SIZE,
//		CFG_BLE_MBLOCK_COUNT,
//		CFG_BLE_MAX_ATT_MTU,
//		CFG_BLE_SLAVE_SCA,
//		CFG_BLE_MASTER_SCA,
//		CFG_BLE_LSE_SOURCE,
//		CFG_BLE_MAX_CONN_EVENT_LENGTH,
//		CFG_BLE_HSE_STARTUP_TIME,
//		CFG_BLE_VITERBI_MODE,
//		CFG_BLE_OPTIONS, 0,
//		CFG_BLE_MAX_COC_INITIATOR_NBR,
//		CFG_BLE_MIN_TX_POWER,
//		CFG_BLE_MAX_TX_POWER } };

	  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
	  {
	    {{0,0,0}},                          /**< Header unused */
	    {0,                                 /** pBleBufferAddress not used */
	     0,                                  /** BleBufferSize not used */
	     CFG_BLE_NUM_GATT_ATTRIBUTES,
	     CFG_BLE_NUM_GATT_SERVICES,
	     CFG_BLE_ATT_VALUE_ARRAY_SIZE,
	     CFG_BLE_NUM_LINK,
	     CFG_BLE_DATA_LENGTH_EXTENSION,
	     CFG_BLE_PREPARE_WRITE_LIST_SIZE,
	     CFG_BLE_MBLOCK_COUNT,
	     CFG_BLE_MAX_ATT_MTU,
	     CFG_BLE_PERIPHERAL_SCA,
	     CFG_BLE_CENTRAL_SCA,
	     CFG_BLE_LS_SOURCE,
	     CFG_BLE_MAX_CONN_EVENT_LENGTH,
	     CFG_BLE_HSE_STARTUP_TIME,
	     CFG_BLE_VITERBI_MODE,
	     CFG_BLE_OPTIONS,
	     0,
	     CFG_BLE_MAX_COC_INITIATOR_NBR,
	     CFG_BLE_MIN_TX_POWER,
	     CFG_BLE_MAX_TX_POWER,
	     CFG_BLE_RX_MODEL_CONFIG,
	     CFG_BLE_MAX_ADV_SET_NBR,
	     CFG_BLE_MAX_ADV_DATA_LEN,
	     CFG_BLE_TX_PATH_COMPENS,
	     CFG_BLE_RX_PATH_COMPENS,
	     CFG_BLE_CORE_VERSION,
	     CFG_BLE_OPTIONS_EXT
	    }
	  };


