pchwalek/buzzcam/STM32_WPAN/App/app_ble.c
	  a_ManufDataCameraWakeup[0] = sizeof(a_ManufDataCameraWakeup) - 1;
	  a_ManufDataCameraWakeup[1] = AD_TYPE_MANUFACTURER_SPECIFIC_DATA;
	  /* set the manufacturing data for wakeon packet */
	  a_ManufDataCameraWakeup[2] = 0x4c;
	  a_ManufDataCameraWakeup[3] = 0x00;
	  a_ManufDataCameraWakeup[4] = 0x02;
	  a_ManufDataCameraWakeup[5] = 0x15;
	  a_ManufDataCameraWakeup[6] = 0x09;
	  a_ManufDataCameraWakeup[7] = 0x4f;
	  a_ManufDataCameraWakeup[8] = 0x52;
	  a_ManufDataCameraWakeup[9] = 0x42;
	  a_ManufDataCameraWakeup[10] = 0x49;
	  a_ManufDataCameraWakeup[11] = 0x54;
	  a_ManufDataCameraWakeup[12] = 0x09;
	  a_ManufDataCameraWakeup[13] = 0xff;
	  a_ManufDataCameraWakeup[14] = 0x0f;
	  a_ManufDataCameraWakeup[15] = 0x00;
	    /* note: see powerOnPrevConnectedCameras() for bytes 16-21 */
	  a_ManufDataCameraWakeup[22] = 0x00;
	  a_ManufDataCameraWakeup[23] = 0x00;
	  a_ManufDataCameraWakeup[24] = 0x00;
	  a_ManufDataCameraWakeup[25] = 0x00;
	  a_ManufDataCameraWakeup[26] = 0xe4;
	  a_ManufDataCameraWakeup[27] = 0x01;

	   /**
	    * Initialize Ble Transport Layer
	    */
	   Ble_Tl_Init();

	   /**
	    * Do not allow standby in the application
	    */
	   UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);


	   MtxHciId = osMutexNew(NULL);
	   SemHciId = osSemaphoreNew(1, 0, NULL); /*< Create the semaphore and make it busy at initialization */


	   /**
	    * Starts the BLE Stack on CPU2
	    */
	   status = SHCI_C2_BLE_Init(&ble_init_cmd_packet);
	   if (status != SHCI_Success)
	   {
	     APP_DBG_MSG("  Fail   : SHCI_C2_BLE_Init command, result: 0x%02x\n\r", status);
	     /* if you are here, maybe CPU2 doesn't contain STM32WB_Copro_Wireless_Binaries, see Release_Notes.html */
	     Error_Handler();
	   }
	   else
	   {
	     APP_DBG_MSG("  Success: SHCI_C2_BLE_Init command\n\r");
	   }


	   /**
	    * Initialization of HCI & GATT & GAP layer
	    */
	   Ble_Hci_Gap_Gatt_Init();

	   /**
	    * Initialization of the BLE Services
	    */
	   SVCCTL_Init();

	   /**
	    * Initialization of the BLE App Context
	    */
	   BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
	   BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;

	   /**
	    * Register the hci transport layer to handle BLE User Asynchronous Events
	    */
	   HciUserEvtProcessId = osThreadNew(HciUserEvtProcess, NULL, &HciUserEvtProcess_attr);

	   /**
	    * From here, all initialization are BLE application specific
	    */
	   AdvUpdateProcessId = osThreadNew(AdvUpdateProcess, NULL, &AdvUpdateProcess_attr);

	   aci_hal_set_radio_activity_mask(0x0006);

		  /**
		   * Make device discoverable
		   */
		  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = AD_TYPE_16_BIT_SERV_UUID;
		  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 0;
		  Add_Advertisment_Service_UUID(BUZZCAM_SERVICE_UUID);

	   /**
	    * Initialization of ADV - Ad Manufacturer Element - Support OTA Bit Mask
	    */
	 #if (BLE_CFG_OTA_REBOOT_CHAR != 0)
	   a_ManufData[sizeof(a_ManufData)-8] = CFG_FEATURE_OTA_REBOOT;
	 #endif /* BLE_CFG_OTA_REBOOT_CHAR != 0 */
	#endif

	#ifndef CUSTOM_BT_PARAMETERS
	  /* USER CODE END APP_BLE_Init_3 */

	  /**
	   * Create timer to handle the connection state machine
	   */
	  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.Advertising_mgr_timer_Id), hw_ts_SingleShot, Adv_Mgr);

	  /**
	   * Make device discoverable
	   */
	  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = AD_TYPE_16_BIT_SERV_UUID;
	  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 1;
	  Add_Advertisment_Service_UUID(HEART_RATE_SERVICE_UUID);

	  /* Initialize intervals for reconnexion without intervals update */
	  AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
	  AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;

	  /**
	   * Start to Advertise to be connected by Collector
	   */
	  Adv_Request(APP_BLE_FAST_ADV);


	#else
	  /**
	   * Create timer to handle the connection state machine
	   */
	  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.Advertising_mgr_timer_Id), hw_ts_SingleShot, Adv_Mgr);



#endif
	  return;
}

void APP_BLE_Init_Dyn_2( void ) {


	//  /**
	//   * Make device discoverable
	//   */
	//  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[0] = NULL; //TODO: the heartbeat example uses: AD_TYPE_16_BIT_SERV_UUID
	//  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen = 0;
	//  /* Initialize intervals for reconnexion without intervals update */
	AdvIntervalMin = CFG_FAST_CONN_ADV_INTERVAL_MIN;
	AdvIntervalMax = CFG_FAST_CONN_ADV_INTERVAL_MAX;

	/**
	 * Start to Advertise to be connected by P2P Client
	 */
#ifndef DYNAMIC_MODE
	Adv_Request(APP_BLE_FAST_ADV);
#else
	osThreadFlagsSet(AdvUpdateProcessId, 1);
//	Adv_Request(APP_BLE_LP_ADV);
#endif
	/* USER CODE BEGIN APP_BLE_Init_2 */

	/* USER CODE END APP_BLE_Init_2 */
	return;
}

void SVCCTL_InitCustomSvc(void) {
#ifndef TESTING_ACTIVE
	DTS_STM_Init();
#endif
}

void SVCCTL_SvcInit(void)
{
//  BAS_Init();
//
//  BLS_Init();
//
//  CRS_STM_Init();
//
//  //DIS_Init();
//
//  EDS_STM_Init();
//
//  HIDS_Init();
//
////  HRS_Init();
////
////  HTS_Init();
//
//  IAS_Init();
//
//  LLS_Init();
//
//  TPS_Init();
//
//  MOTENV_STM_Init();
//
//  P2PS_STM_Init();
//
//  ZDD_STM_Init();
//
//  OTAS_STM_Init();

//  BVOPUS_STM_Init();
//
//  MESH_Init();

  SVCCTL_InitCustomSvc();

  return;
}

/* USER CODE END FD*/

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Ble_Tl_Init(void)
{
  HCI_TL_HciInitConf_t Hci_Tl_Init_Conf;

  Hci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*)&BleCmdBuffer;
  Hci_Tl_Init_Conf.StatusNotCallBack = BLE_StatusNot;
  hci_init(BLE_UserEvtRx, (void*) &Hci_Tl_Init_Conf);

  return;
}

static void Ble_Hci_Gap_Gatt_Init(void)
{
  uint8_t role;
  uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;
  const uint8_t *p_bd_addr;
  uint16_t a_appearance[1] = {BLE_CFG_GAP_APPEARANCE};
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  /* USER CODE BEGIN Ble_Hci_Gap_Gatt_Init*/

  /* USER CODE END Ble_Hci_Gap_Gatt_Init*/

  APP_DBG_MSG("==>> Start Ble_Hci_Gap_Gatt_Init function\n");

  /**
   * Initialize HCI layer
   */
  /*HCI Reset to synchronise BLE Stack*/
  ret = hci_reset();
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : hci_reset command, result: 0x%x \n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: hci_reset command\n");
  }

  /**
   * Write the BD Address
   */
  p_bd_addr = BleGetBdAddress();
  ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET, CONFIG_DATA_PUBADDR_LEN, (uint8_t*) p_bd_addr);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET, result: 0x%x \n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET\n");
    APP_DBG_MSG("  Public Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x\n",p_bd_addr[5],p_bd_addr[4],p_bd_addr[3],p_bd_addr[2],p_bd_addr[1],p_bd_addr[0]);
  }

