pchwalek/buzzcam/STM32_WPAN/App/app_ble.c
  if(NewStatus != APP_BLE_CAM_LP_ADV){
	  BleApplicationContext.Device_Connection_Status = NewStatus;
  }else if(NewStatus == APP_BLE_LP_ADV){
	  BleApplicationContext.Device_Connection_Status = APP_BLE_LP_ADV;
  }
  /* Start Fast or Low Power Advertising */
  ret = aci_gap_set_discoverable(ADV_IND,
                                 Min_Inter,
                                 Max_Inter,
								 GAP_PUBLIC_ADDR,
                                 NO_WHITE_LIST_USE, /* use white list */
                                 sizeof(a_LocalName),
                                 (uint8_t*) &a_LocalName,
                                 BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen,
                                 BleApplicationContext.BleApplicationContext_legacy.advtServUUID,
                                 0,
                                 0);
  if (ret != BLE_STATUS_SUCCESS)
  {
    Error_Handler();
  }

  /* Update Advertising data */
  ret = aci_gap_update_adv_data(sizeof(a_ManufData), (uint8_t*) a_ManufData);
  HW_TS_Start(BleApplicationContext.Advertising_mgr_timer_Id, INITIAL_ADV_TIMEOUT);

  if(NewStatus == APP_BLE_CAM_LP_ADV){
	  aci_gap_delete_ad_type(AD_TYPE_16_BIT_SERV_UUID);
		aci_gap_delete_ad_type(AD_TYPE_16_BIT_SERV_UUID_CMPLT_LIST);
		aci_gap_delete_ad_type(AD_TYPE_32_BIT_SERV_UUID);
		aci_gap_delete_ad_type(AD_TYPE_32_BIT_SERV_UUID_CMPLT_LIST);
		aci_gap_delete_ad_type(AD_TYPE_128_BIT_SERV_UUID);
		aci_gap_delete_ad_type(AD_TYPE_128_BIT_SERV_UUID_CMPLT_LIST);
		aci_gap_delete_ad_type(AD_TYPE_SHORTENED_LOCAL_NAME);
		aci_gap_delete_ad_type(AD_TYPE_COMPLETE_LOCAL_NAME);
		aci_gap_delete_ad_type(AD_TYPE_TX_POWER_LEVEL);
		aci_gap_delete_ad_type(AD_TYPE_CLASS_OF_DEVICE);
		aci_gap_delete_ad_type(AD_TYPE_SEC_MGR_TK_VALUE);
		aci_gap_delete_ad_type(AD_TYPE_SEC_MGR_OOB_FLAGS);
		aci_gap_delete_ad_type(AD_TYPE_PERIPHERAL_CONN_INTERVAL);
		aci_gap_delete_ad_type(AD_TYPE_SERV_SOLICIT_16_BIT_UUID_LIST);
		aci_gap_delete_ad_type(AD_TYPE_SERV_SOLICIT_128_BIT_UUID_LIST);
		aci_gap_delete_ad_type(AD_TYPE_SERVICE_DATA);
		aci_gap_delete_ad_type(AD_TYPE_APPEARANCE);
		aci_gap_delete_ad_type(AD_TYPE_ADVERTISING_INTERVAL);
		aci_gap_delete_ad_type(AD_TYPE_LE_ROLE);
		aci_gap_delete_ad_type(AD_TYPE_SERV_SOLICIT_32_BIT_UUID_LIST);
	  aci_gap_delete_ad_type(AD_TYPE_URI);

		ret = aci_gap_update_adv_data(sizeof(a_ManufDataCameraWakeup), (uint8_t*) a_ManufDataCameraWakeup);

  }else{
	  ret = aci_gap_update_adv_data(sizeof(a_ManufData), (uint8_t*) a_ManufData);

  }
//  if (ret != BLE_STATUS_SUCCESS)
//  {
//    if (NewStatus == APP_BLE_FAST_ADV)
//    {
//      APP_DBG_MSG("==>> Start Fast Advertising Failed , result: %d \n\r", ret);
//    }
//    else
//    {
//      APP_DBG_MSG("==>> Start Low Power Advertising Failed , result: %d \n\r", ret);
//    }
//  }
//  else
//  {
//    if (NewStatus == APP_BLE_FAST_ADV)
//    {
//      APP_DBG_MSG("==>> Success: Start Fast Advertising \n\r");
//      /* Start Timer to STOP ADV - TIMEOUT - and next Restart Low Power Advertising */
//      HW_TS_Start(BleApplicationContext.Advertising_mgr_timer_Id, INITIAL_ADV_TIMEOUT);
//    }
//    else
//    {
//      APP_DBG_MSG("==>> Success: Start Low Power Advertising \n\r");
//    }
//  }

  return;
}

const uint8_t* BleGetBdAddress(void)
{
  uint8_t *p_otp_addr;
  const uint8_t *p_bd_addr;
  uint32_t udn;
  uint32_t company_id;
  uint32_t device_id;

  udn = LL_FLASH_GetUDN();

  if (udn != 0xFFFFFFFF)
  {
    company_id = LL_FLASH_GetSTCompanyID();
    device_id = LL_FLASH_GetDeviceID();

    /**
     * Public Address with the ST company ID
     * bit[47:24] : 24bits (OUI) equal to the company ID
     * bit[23:16] : Device ID.
     * bit[15:0] : The last 16bits from the UDN
     * Note: In order to use the Public Address in a final product, a dedicated
     * 24bits company ID (OUI) shall be bought.
     */
    a_BdAddrUdn[0] = (uint8_t)(udn & 0x000000FF);
    a_BdAddrUdn[1] = (uint8_t)((udn & 0x0000FF00) >> 8);
    a_BdAddrUdn[2] = (uint8_t)device_id;
    a_BdAddrUdn[3] = (uint8_t)(company_id & 0x000000FF);
    a_BdAddrUdn[4] = (uint8_t)((company_id & 0x0000FF00) >> 8);
    a_BdAddrUdn[5] = (uint8_t)((company_id & 0x00FF0000) >> 16);

    p_bd_addr = (const uint8_t *)a_BdAddrUdn;
  }
  else
  {
    p_otp_addr = OTP_Read(0);
    if (p_otp_addr)
    {
      p_bd_addr = ((OTP_ID0_t*)p_otp_addr)->bd_address;
    }
    else
    {
      p_bd_addr = a_MBdAddr;
    }
  }

  return p_bd_addr;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 *SPECIFIC FUNCTIONS
 *
 *************************************************************/
static void Add_Advertisment_Service_UUID(uint16_t servUUID)
{
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen] =
      (uint8_t) (servUUID & 0xFF);
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen++;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUID[BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen] =
      (uint8_t) (servUUID >> 8) & 0xFF;
  BleApplicationContext.BleApplicationContext_legacy.advtServUUIDlen++;

  return;
}

static void Adv_Mgr(void)
{
  /**
   * The code shall be executed in the background as an aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  osThreadFlagsSet(AdvUpdateProcessId, 1);

  return;
}

static void AdvUpdateProcess(void *argument)
{
  UNUSED(argument);
  uint32_t flags;
  for(;;)
  {
    flags = osThreadFlagsWait(1, osFlagsWaitAny, osWaitForever);

    if( (flags & 0x1) == 0x1){
    	ot_StatusNot(ot_TL_CmdBusy);
    	ot_StatusNot(ot_TL_CmdAvailable);

