pchwalek/buzzcam/STM32_WPAN/App/app_ble.c
//    	osDelay(5000);

//    	  LL_C1_IPCC_EnableTransmitChannel( IPCC, HW_IPCC_SYSTEM_CMD_RSP_CHANNEL );
//    	  HW_IPCC_BLE_Init();
//    	  LL_C1_IPCC_ClearFlag_CHx( IPCC, HW_IPCC_BLE_EVENT_CHANNEL );

    	Adv_Update();
    }
  }
}

static void Adv_Update(void)
{
//  Adv_Request(APP_BLE_LP_ADV);
  Adv_Request(APP_BLE_LP_ADV);
  return;
}

static void HciUserEvtProcess(void *argument)
{
  UNUSED(argument);
  uint32_t flag;
  for(;;)
  {
    flag = osThreadFlagsWait(1, osFlagsWaitAny, osWaitForever);
    if((flag & 0x1) == 0x1){
    	ot_StatusNot(ot_TL_CmdBusy);
    	ot_StatusNot(ot_TL_CmdAvailable);
    	hci_user_evt_proc();
    }
  }
}

/* USER CODE BEGIN FD_SPECIFIC_FUNCTIONS */

/* USER CODE END FD_SPECIFIC_FUNCTIONS */
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/
void hci_notify_asynch_evt(void* p_Data)
{
  UNUSED(p_Data);
  osThreadFlagsSet(HciUserEvtProcessId, 1);

  return;
}

void hci_cmd_resp_release(uint32_t Flag)
{
  UNUSED(Flag);
  osSemaphoreRelease(SemHciId);

  return;
}

void hci_cmd_resp_wait(uint32_t Timeout)
{
  UNUSED(Timeout);
  osSemaphoreAcquire(SemHciId, osWaitForever);

  return;
}

static void BLE_UserEvtRx(void *p_Payload)
{
  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
  tHCI_UserEvtRxParam *p_param;

  p_param = (tHCI_UserEvtRxParam *)p_Payload;

  svctl_return_status = SVCCTL_UserEvtRx((void *)&(p_param->pckt->evtserial));
  if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
  {
    p_param->status = HCI_TL_UserEventFlow_Enable;
  }
  else
  {
    p_param->status = HCI_TL_UserEventFlow_Disable;
  }

  return;
}

static void BLE_StatusNot(HCI_TL_CmdStatus_t Status)
{
  switch (Status)
  {
    case HCI_TL_CmdBusy:
    if(osOK != osMutexAcquire(MtxHciId, osWaitForever)){
    	Error_Handler();
    }
//  	ot_StatusNot(ot_TL_CmdBusy);


      /* USER CODE BEGIN HCI_TL_CmdBusy */

      /* USER CODE END HCI_TL_CmdBusy */
      break;

    case HCI_TL_CmdAvailable:

        if(osOK != osMutexRelease(MtxHciId)){
        	Error_Handler();
        }
//    	ot_StatusNot(ot_TL_CmdAvailable);


      /* USER CODE BEGIN HCI_TL_CmdAvailable */

      /* USER CODE END HCI_TL_CmdAvailable */
      break;

    default:
      /* USER CODE BEGIN Status */

      /* USER CODE END Status */
      break;
  }

  return;
}

void SVCCTL_ResumeUserEventFlow(void)
{
  hci_resume_flow();

  return;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
char hexToAscii(uint8_t val){
	// only look at first 4 bits
	val = val & (0x0F);
	if(val<10) return val+48;
	else return val+87;
}
/* USER CODE END FD_WRAP_FUNCTIONS */
